#
# \u30c7\u30d0\u30c3\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8
#
D-SPRINGMVC-REST-HANDLER#0001=\
    \u5bfe\u8c61\u306e\u30ea\u30bd\u30fc\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306eURL\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0002=\
    \u30ea\u30af\u30a8\u30b9\u30c8\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306eMethod(GET/POST/PUT/DELETE\u306a\u3069)\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0003=\
    \u30ea\u30af\u30a8\u30b9\u30c8\u3055\u308c\u305f\u30e1\u30c7\u30a3\u30a2\u30bf\u30a4\u30d7\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306eContentType\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0004=\
    \u30ea\u30af\u30a8\u30b9\u30c8\u3055\u308c\u305f\u30e1\u30c7\u30a3\u30a2\u30bf\u30a4\u30d7\u3092\u8a31\u5bb9\u3067\u304d\u307e\u305b\u3093\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306eContentType\u3092\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u30e1\u30c7\u30a3\u30a2\u30bf\u30a4\u30d7\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0005=\
    \u30ea\u30af\u30a8\u30b9\u30c8\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0006=\
    \u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
D-SPRINGMVC-REST-HANDLER#0007=\
    \u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u5bfe\u5fdc\u3059\u308bPropertyEditor\u3084MessageConverter\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30b5\u30fc\u30d0\u30b5\u30a4\u30c9\u306e\u8a2d\u5b9a\u306a\u3069\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0008=\
    \u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u578b\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u578b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0009=\
    MessageConverter\u304c\u8aad\u307f\u8fbc\u3081\u306a\u3044\u5f62\u5f0f\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3059\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306eContentType\u3082\u3057\u304f\u306f\u30ea\u30af\u30a8\u30b9\u30c8\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0010=\
    MessageConverter\u304c\u66f8\u304d\u8fbc\u3081\u306a\u3044\u5f62\u5f0f\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u3067\u3059\u3002\u30b5\u30fc\u30d0\u30b5\u30a4\u30c9\u306eContentType\u3082\u3057\u304f\u306f\u30ec\u30b9\u30dd\u30f3\u30b9\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0011=\
    multipart/form-data\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u4e00\u90e8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306eform-data\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0012=\
    \u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u5024\u3092\u8a2d\u5b9a\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0013=\
    \u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u5024\u3092\u8a2d\u5b9a\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0014=\
    REST\u64cd\u4f5c\u3067\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30a4\u30c9\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002REST\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u30c7\u30fc\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0015=\
    REST\u64cd\u4f5c\u3067\u30b5\u30fc\u30d0\u30b5\u30a4\u30c9\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002REST\u5bfe\u8c61\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u72b6\u614b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
D-SPRINGMVC-REST-HANDLER#0016=\
    \u4e88\u671f\u3057\u306a\u3044\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
D-SPRINGMVC-REST-HANDLER#0017=\
    \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u56de\u5fa9\u53ef\u80fd\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
D-SPRINGMVC-REST-HANDLER#0018=\
    \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u56de\u5fa9\u4e0d\u53ef\u80fd\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
D-SPRINGMVC-REST-HANDLER#0019=\
    \u30b7\u30b9\u30c6\u30e0\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002